Repository: Eng-Mahmoud-Mokhtar/Tawq_Al_Najah
Catalog: Assets/Localization/intl_*.arb
Languages: ar

# OnBoarding1title
source: Welcome to our world!
ar: مرحبًا بك في عالمنا !

# OnBoarding1description
source: Start your journey with us and discover a smart and easy shopping experience at your fingertips.
ar: ابدأ رحلتك معنا واكتشف تجربة تسوق ذكية وسهلة في متناول يدك.

# OnBoarding2title
source: Everything you need in one place
ar: كل ما تحتاجه في مكان واحد

# OnBoarding2description
source: From your favorite products to the latest offers — everything is within your reach in one step.
ar: من منتجاتك المفضلة إلى أحدث العروض، كل شيء بين يديك بخطوة واحدة.

# OnBoarding3title
source: Shop smart and confidently
ar: تسوق بذكاء وثقة

# OnBoarding3description
source: We offer you a shopping experience that combines speed, comfort, and the quality you deserve.
ar: نمنحك تجربة تسوق تجمع بين السرعة، الراحة، والجودة التي تستحقها.

source: Start
ar: ابدأ

source: Next
ar: التالي

source: Skip
ar: تخطي

source: Not a member?
ar: لست عضوًا؟

source: Sign Up
ar: إنشاء حساب

source: Login
ar: تسجيل الدخول

source: Verify Phone Number
ar: تأكيد رقم الهاتف

# SubVerifyPhoneNumber
source: Enter the verification code sent to
ar: أدخل رمز التحقق المرسل إلى

source: Verify
ar: تأكيد

# ResendCode
source: Resend code after
ar: إعادة إرسال الرمز بعد

source: Full Name
ar: الاسم

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Phone Number
ar: رقم الهاتف

# location
source: Address
ar: العنوان

source: Country
ar: الدولة

source: City
ar: المدينة/المحافظة

source: Choose Country Code
ar: اختر رمز الدولة

# ChooseAccountType
source: Choose the account type that suits your needs.
ar: اختر نوع الحساب الذي يناسب احتياجاتك.

source: Seller
ar: بائع

source: Buyer
ar: مشتري

source: More
ar: المزيد

source: Language
ar: اللغة

source: Hello Mahmoud
ar: أهلا محمود

# MyShipments
source: My Orders
ar: طلباتي

# profile
source: My Profile
ar: حسابي

source: Home
ar: الرئيسية

source: Cart
ar: السلة

source: Add to Cart
ar: اضف للسلة

source: Product
ar: منتج

# notificationsTitle
source: Notifications
ar: الإشعارات

# noNotifications
source: You have no notifications yet
ar: ليس لديك إشعارات بعد

# exclusiveOffer
source: Enjoy an exclusive 25% discount on your first order
ar: استمتع بخصم حصري 25% على أول طلب لك

source: Browse Products
ar: تصفح المنتجات

# SYP
source: SAR
ar: ر.س

source: Products
ar: المنتجات

source: Subtotal
ar: الإجمالي

source: Total
ar: المجموع

source: Checkout
ar: الدفع

# emptyCart
source: Your cart is empty!
ar: السلة فارغة!

# browseAndShopNow
source: Browse products and shop now
ar: تصفح المنتجات وقم بالشراء الآن

source: Payment Method
ar: وسيلة الدفع

source: Cash
ar: نقدًا

source: Visa
ar: فيزا

source: Discount
ar: الخصم

source: Complete Purchase
ar: إتمام الشراء

source: Edit Profile
ar: تعديل الملف الشخصي

source: Favorite Products
ar: المنتجات المفضلة

source: Logout
ar: الخروج من التطبيق

source: Save
ar: حفظ

source: Cancel
ar: الغاء

source: Favorite
ar: المفضلة

# noFavorites
source: No favorite products
ar: لا توجد منتجات مفضلة

source: Edit
ar: تعديل

source: Street
ar: الشارع

source: Description
ar: الوصف

source: Search
ar: بحث

source: Search not found
ar: بحث غير موجود

source: Delete
ar: حذف

source: New Notification
ar: اشعار جديد

source: About Us
ar: من نحن

source: Privacy Policy
ar: سياسة الخصوصية

source: App Support
ar: دعم التطبيق

source: Terms and Conditions
ar: الشروط والاحكام

source: No Results to Show
ar: لا توجد نتائج للعرض

source: My Shipments
ar: شحناتي

# currentTab
source: Current
ar: الحالية

# completedTab
source: Completed
ar: المكتملة

# cancelledTab
source: Cancelled
ar: الملغية

# fashionCategory
source: Fashion
ar: أزياء

# electronicsCategory
source: Electronics
ar: إلكترونيات

# kitchenCategory
source: Kitchen
ar: مطبخ

# accessoriesCategory
source: Accessories
ar: إكسسوارات

source: Out of Stock
ar: نفاد الكمية

# shippingNotAvailable
source: Shipping Not Available to This Location
ar: غير متوفر الشحن لهذا المكان

source: Cancellation Reason Not Specified
ar: سبب الإلغاء غير محدد

# receivedStatus
source: Received
ar: تم الاستلام

# cancelledStatus
source: Cancelled
ar: تم الإلغاء

source: Order Details
ar: تفاصيل الطلب

source: Product Details
ar: تفاصيل المنتج

# descriptionLabel
source: Description
ar: الوصف

# quantityLabel
source: Quantity
ar: العدد

# priceLabel
source: Price
ar: السعر

# shippingCostLabel
source: Shipping Cost
ar: مصاريف الشحن

# totalLabel
source: Total
ar: الإجمالي

source: Order Status
ar: حالة الطلب

source: Order Confirmed
ar: تأكيد الطلب

# shippedStatus
source: Shipped
ar: تم الشحن

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: App Support
ar: دعم التطبيق

# chooseSupportType
source: Choose the type of support you wish to provide:
ar: اختر نوع الدعم الذي ترغب في تقديمه:

source: In-Kind Support
ar: الدعم العيني

source: Financial Support Form
ar: نموذج الدعم المادي

# charityName
source: Supported Entity
ar: الجهة المدعومة

# enterCharityName
source: Enter the supported entity name
ar: أدخل اسم الجهة المدعومة

source: Donation Amount
ar: مبلغ التبرع

# enterDonationAmount
source: Enter the donation amount
ar: أدخل مبلغ التبرع

source: Submit Request
ar: إرسال الطلب

# requestReviewNotification
source: Your request will be reviewed, and you will be notified upon approval
ar: سيتم مراجعة طلبك وسيتم إشعارك بالموافقة

source: In-Kind Support Form
ar: نموذج الدعم العيني

# inKindSupportType
source: Type of In-Kind Support
ar: نوع الدعم العيني

# inKindDescriptionExample
source: Write a brief description of the support you want to provide
ar: اكتب وصفًا مختصرًا للدعم الذي ترغب في تقديمه

# requestSentNotification
source: Your request has been sent, a representative will contact you after approval.
ar: تم إرسال طلبك , سيتواصل معك مندوب بعد الموافقة.

# shareReferralCode
source: Share your referral code with your friends!
ar: شارك كود الإحالة الخاص بك مع أصدقائك !

# referralDescription
source: Each person who registers using your code brings you closer to receiving a special reward after a certain number of invites.
ar: كل شخص يستخدم كودك للتسجيل يمنحك نقاطًا أو مكافآت مالية بعد عدد محدد من المشاركات.

# codeCopiedSuccess
source: Code copied successfully!
ar: تم نسخ الكود بنجاح!

source: Your Referral Users
ar: مستخدمي إحالتك

source: Withdraw Earnings
ar: سحب الأرباح

# withdrawnAmount
source: Withdrawn
ar: تم سحب

source: Subtotal
ar: الحساب

source: Shipping Cost
ar: مصاريف الشحن

source: Total
ar: الإجمالي

source: Card Number
ar: رقم البطاقة

source: Expiry Date
ar: تاريخ الانتهاء

source: Card Holder Name
ar: اسم حامل البطاقة

# paymentSuccess
source: Payment Successful
ar: تم الدفع بنجاح

# orderSuccess
source: Order Successful
ar: تم الطلب بنجاح

# categoryUnknown
source: Unspecified
ar: غير محدد

source: Suggestions
ar: الاقتراحات

source: See More
ar: رؤية المزيد

# happyShopping
source: We wish you happy shopping!
ar: نتمنى لك تسوقًا سعيدًا!

source: Lowest Price
ar: الأقل سعرًا

source: Highest Price
ar: الأعلى سعرًا

# tawqalOffers
source: Tawqal Al-Najah Offers
ar: عروض طوق النجاة

source: Filter Products
ar: تصفية المنتجات

source: Select Category
ar: اختر الفئة

# filteredResults
source: Search Results
ar: نتائج البحث

source: Clear All
ar: مسح الكل

source: Country
ar: الدولة

source: Select Country
ar: اختر الدولة

source: Price Range
ar: نطاق السعر

source: Stores
ar: التجار

source: Categories
ar: الفئات

source: Fashion
ar: أزياء

source: Toys
ar: ألعاب

source: Kitchen
ar: مطبخ

source: Health
ar: صحة

source: Filter Merchants
ar: تصفية التجار

source: Category
ar: الفئة

source: All
ar: الجميع

source: Clothes
ar: ملابس

source: Electronics
ar: الكترونيات

source: Furniture
ar: أثاث

source: Food
ar: طعام

source: Apply Filters
ar: تطبيق الفلاتر

source: Merchants
ar: التجار

source: Store
ar: متجر

source: Filter
ar: فلتر

source: Minimum Price
ar: السعر الأدنى

source: Maximum Price
ar: السعر الأعلى

source: City
ar: المدينة/المحافظة

source: Apply
ar: تطبيق

# errorOpeningLink
source: An error occurred while opening the link
ar: حدث خطأ أثناء فتح الرابط

source: Your Product Rating
ar: تقييمك للمنتج

source: Added to Cart
ar: مضاف للسلة

# itemRemoved
source: Removed successfully
ar: تم الحذف بنجاح

source: My Store
ar: متجري

source: My Orders
ar: طلباتي

source: Activity Type
ar: نوع النشاط

source: Enter activity type
ar: أدخل نوع النشاط

# branchesCount
source: Number of Branches
ar: عدد الفروع

# enterBranchesCount
source: Enter number of branches
ar: أدخل عدد الفروع

source: Site Area
ar: مساحة الموقع

source: Enter area
ar: أدخل المساحة

# meters
source: m²
ar: م²

source: Contract Duration
ar: مدة التعاقد

# threeMonths
source: 3 Months
ar: 3 شهور

# sixMonths
source: 6 Months
ar: 6 شهور

# oneYear
source: 1 Year
ar: سنة

source: Other
ar: أخرى

source: Custom Duration
ar: مدة مخصصة

# enterCustomDuration
source: Enter your preferred duration
ar: المدة التي تناسبك

# uploadDocs
source: Upload commercial registration and documents
ar: تحميل السجل التجاري والوثائق

source: Add File
ar: اضافة ملف

# socialLinks
source: Social Media Links
ar: روابط مواقع التواصل الاجتماعي

source: Enter social link
ar: أدخل رابط تواصل

# unsupportedPlatform
source: Invalid or unsupported platform
ar: يوجد خطأ أو المنصة غير مدعومة

source: Shop / Seller Name
ar: اسم المحل / البائع

source: Account Info
ar: معلومات الحساب

source: joined Since
ar: تايخ الانضمام

source: Ratings
ar: التقييمات

source: No contracts found
ar: لا توجد عقود

# branch
source: Branch Location
ar: عنوان الفرع

source: Enter branch location
ar: أدخل عنوان الفرع

source: Total Area
ar: إجمالي المساحة

source: Enter total area
ar: أدخل المساحة

source: Monthly Price
ar: السعر الشهري

# requestSent
source: Your account has been created successfully
ar: تم إنشاء حسابك بنجاح

# requestReview
source: Your account is currently ready for use and is under review to ensure data accuracy. Any submission of false information will result in permanent account suspension.
ar: حسابك جاهز للاستخدام حالياً ويخضع لمرحلة المراجعة لضمان صحة البيانات. في حال إدخال أي بيانات مزيفة، سيتم حظر الحساب نهائياً.

# backHome
source: Back to Home Page
ar: العودة للصفحة الرئيسية

source: related Items
ar: ذات صلة

# contract_history
source: Contracting
ar: التعاقد

# start_date
source: Contract Start Date:
ar: تاريخ التعاقد:

source: End Date:
ar: تاريخ الانتهاء:

source: Renew Contract
ar: طلب تجديد

# renew_success
source: Renewal request sent successfully
ar: تم إرسال طلب التجديد بنجاح

source: Overall Rating
ar: التقييم العام

source: No Shipping
ar: لا يوجد توصيل

source: Local Shipping
ar: توصيل داخلي

# bothShipping
source: Local & International Shipping
ar: توصيل داخلي ودولي

source: Installment not available
ar: التقسيط غير متاح

source: installment
ar: تقسيط

source: Cancel Order
ar: إلغاء الطلب

# cancelOrderConfirmation
source: Are you sure you want to cancel this order? A portion may be deducted based on app policy.
ar: هل أنت متأكد أنك تريد إلغاء هذا الطلب؟ قد يتم خصم جزء من المبلغ حسب سياسة التطبيق

source: No
ar: لا

source: Yes
ar: نعم

source: Cancelled
ar: تم الإلغاء

source: Manage Orders
ar: إدارة الطلبات

# pendingTab
source: New Orders
ar: طلبات جديدة

# confirmedTab
source: Confirmed
ar: مؤكدة

# shippedTab
source: Shipped
ar: تم الشحن

# deliveredTab
source: Delivered
ar: تم التوصيل

source: No orders yet
ar: لا توجد طلبات بعد

# customerInfo
source: Customer Information
ar: بيانات العميل

source: Order Tracking
ar: تتبع الطلب

source: Request Reward
ar: طلب استلام المكافأة

# rewardRequestSent
source: Your reward request has been submitted successfully!
ar: تم إرسال طلب استلام المكافأة بنجاح!

# rewards_description
source: Track your earned rewards from referrals and support
ar: تابع مكافآتك المكتسبة من الإحالات والدعم

# support_count
source: Support contributions
ar: عدد مرات الدعم

# otherCategory
source: Other
ar: آخر

# productsCount
source: Number of Products
ar: عدد المنتجات

# enterProductsCount
source: e.g., 500
ar: مثال: 500

source: Monthly Visitors
ar: الزوار الشهري

# enterVisitorsCount
source: e.g., 10000
ar: مثال: 10000

# pleaseSelectCategory
source: Please select a category
ar: الرجاء اختيار الفئة

source: Books
ar: كتب

source: Bank Account
ar: الحساب البنكي

source: Bank Name
ar: اسم البنك

# enterBankName
source: Enter the bank name
ar: أدخل اسم البنك

source: IBAN Number
ar: رقم (IBAN)

source: Account Holder Name
ar: اسم صاحب الحساب

# enterFullBankName
source: Enter the full name as registered in the bank
ar: أدخل الاسم الكامل كما هو مسجل في البنك

source: Linked Phone Number
ar: رقم الجوال المرتبط بالحساب

# enterRegisteredPhone
source: Enter the phone number registered with the bank
ar: أدخل رقم الجوال المسجل في البنك

# proofOfOwnership
source: Proof of Bank Account Ownership
ar: إثبات ملكية الحساب البنكي

# tapToUpload
source: Tap here to upload a photo of the bank statement or bank card
ar: اضغط هنا لرفع صورة كشف الحساب أو البطاقة البنكية

source: Under Review
ar: قيد المراجعة

source: Submit for Review
ar: إرسال للمراجعة

# bankSubmittedSuccessfully
source: Bank account details submitted successfully
ar: تم إرسال بيانات الحساب البنكي للمراجعة بنجاح

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: Our Services
ar: خدماتنا

source: New Orders
ar: الطلبات الجديدة

source: Cancelled Orders
ar: الطلبات الملغاة

source: Financial Accounts
ar: الحسابات المالية

# adTermsTitle
source: Ad Posting Terms
ar: شروط إضافة الإعلان

# adTermsContent
source: - The product must be real and match the displayed photos. - The ad must contain a clear and accurate description of the product. - Photos must be recent, clear, and truthful. - Fake or duplicate products are prohibited. - The ad will be reviewed before final publication. - In case of violation, the administration reserves the right to delete the ad without prior notice.
ar: - يجب أن يكون المنتج حقيقي ومطابق للصور المعروضة. - يجب أن يحتوي الإعلان على وصف دقيق وواضح للمنتج. - يجب أن تكون الصور حديثة وواضحة وتعرض المنتج بشكل صادق. - يُمنع نشر منتجات وهمية أو مكررة. - سيخضع الإعلان للمراجعة قبل النشر النهائي. - في حال المخالفة، يحق للإدارة حذف الإعلان دون إشعار مسبق.

# agreeToTerms
source: I have read and agree to the above advertisement terms.
ar: قرأت شروط الإعلان السابقة وأوافق عليها.

# mustAcceptTerms
source: You must accept the terms before continuing.
ar: يجب الموافقة على الشروط قبل المتابعة.

# addAd
source: Add Advertisement
ar: إضافة إعلان

# appName
source: My Store
ar: متجري

source: Edit Ad
ar: تعديل الإعلان

source: Product Name
ar: اسم المنتج

source: Quantity
ar: الكمية

source: Currency
ar: العملة

source: Price
ar: السعر

source: Product Description
ar: وصف المنتج

# writeDescription
source: Write the product description here...
ar: اكتب وصف المنتج هنا...

source: Images (max 10)
ar: الصور (الحد الأقصى 10)

source: Add Images
ar: إضافة صور

source: Shipping Options
ar: خيارات الشحن

source: None
ar: لا يوجد

source: Local
ar: محلي

# localAndInternational
source: Local & International
ar: محلي ودولي

source: Installment Available?
ar: متاح التقسيط؟

source: Post Ad
ar: نشر الإعلان

source: Save Changes
ar: حفظ التغييرات

source: Incomplete Data
ar: بيانات ناقصة

# fillRequiredFields
source: Please fill in all required fields.
ar: يرجى ملء جميع الحقول المطلوبة.

source: Image Limit
ar: حد الصور

# max10Images
source: You can’t add more than 10 images.
ar: لا يمكنك إضافة أكثر من 10 صور.

source: Added
ar: تمت الإضافة

# maxImagesReached
source: You’ve reached the maximum number of 10 images.
ar: لقد وصلت إلى الحد الأقصى وهو 10 صور.

source: Posted Successfully
ar: تم النشر بنجاح

# adPosted
source: Your ad has been posted successfully!
ar: تم نشر إعلانك بنجاح!

source: Edited Successfully
ar: تم التعديل بنجاح

# adUpdated
source: The ad has been updated successfully!
ar: تم تحديث الإعلان بنجاح!

# afterSellingQuantity
source: After selling this quantity, the product will be automatically removed.
ar: بعد بيع هذه الكمية، سيتم إزالة المنتج تلقائيًا.

source: OK
ar: حسناً

source: Close
ar: إغلاق

source: Choose currency
ar: اختر العملة

source: My Store
ar: متجري

source: No ads yet
ar: لا توجد إعلانات حتى الآن

source: Confirmed
ar: مؤكد

source: Shipped
ar: تم الشحن

source: Delivered
ar: مستلم

source: Confirm {action}
ar: تأكيد

# confirmActionMessage
source: Are you sure you want to perform this action?
ar: هل أنت متأكد من تنفيذ هذه العملية؟

source: SAR
ar: ر.س

# orderPendingMessage
source: Confirming the order will notify the customer immediately
ar: بتأكيدك للطلب سيتم إخطار العميل مباشرة

source: Order cancelled by customer
ar: تم إلغاء الطلب من قبل العميل

source: Confirm
ar: تأكيد

source: Ship
ar: شحن

source: Confirm Order
ar: تأكيد الطلب

source: Ship Order
ar: شحن الطلب

source: Mark as Delivered
ar: تم التوصيل

# confirmedOrders
source: Confirmed
ar: المؤكدة

# shippedOrders
source: Shipped
ar: المشحونة

# deliveredOrders
source: Delivered
ar: تم التسليم

# sellerNewOrders
source: New Orders
ar: الطلبات الجديدة

# sellerCancelledOrders
source: Cancelled Orders
ar: الطلبات الملغاة

# sellerActiveOrders
source: Active Orders
ar: الطلبات النشطة

source: Profit Details
ar: تفاصيل الأرباح

# noData
source: No data available
ar: لا توجد بيانات

source: Order ID
ar: رقم الطلب

source: Amount
ar: المبلغ

source: Code
ar: الكود

source: Status
ar: الحالة

source: Date
ar: التاريخ

source: Profit Report
ar: تقرير الأرباح

source: Monthly Orders
ar: الطلبات الشهرية

source: Paid
ar: مدفوعة

source: Subscription Details
ar: تفاصيل الاشتراك

source: Duration
ar: المدة

source: Choose Payment Method
ar: اختر طريقة الدفع

# payWithVisa
source: Pay with your Visa card
ar: ادفع باستخدام بطاقة فيزا الخاصة بك

source: MasterCard
ar: ماستر كارد

# payWithMasterCard
source: Pay with your MasterCard
ar: ادفع باستخدام بطاقة ماستر كارد

source: Pay Now
ar: ادفع الآن

# ordersMonthly
source: Monthly Orders
ar: الطلبات الشهرية

source: Months
ar: اشهر

# ReferralCode
source: Marketer Code (optional)
ar: كود المسوق (اختياري)

# M
source: m²
ar: م²

source: Pending
ar: قيد الانتظار

source: Unknown
ar: غير معروف

source: No description
ar: لا يوجد وصف متاح

# deleteAdTitle
source: Delete Ad
ar: حذف الإعلان

# deleteAdContent
source: Are you sure you want to permanently delete this ad?
ar: هل أنت متأكد من حذف الإعلان نهائيًا؟

source: Error
ar: خطأ

# linkErrorTitle
source: Link Error
ar: خطأ في الرابط

source: Ad not found
ar: الإعلان غير موجود

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# forgotPassword
source: Forgot your password?
ar: نسيت كلمة المرور؟

source: Reset Code
ar: رمز الاستعادة

source: My Ads
ar: إعلاناتي

source: Explore
ar: استكشف

source: Marketplace
ar: السوق

# adPriceTitle
source: Ad Price
ar: سعر الإعلان

# adPriceValue
source: SAR
ar: ريال

# adPaymentText
source: Pay now to complete posting your ad
ar: ادفع الآن لإكمال نشر إعلانك

# charityOption1
source: Red Crescent
ar: الهلال الأحمر

# charityOption2
source: Al-Amal Charity
ar: جمعية الأمل الخيرية

# charityOption3
source: Syrian Food Bank
ar: بنك الطعام السوري

source: Marketing
ar: تسويق

# joinAffiliateProgram
source: Join the affiliate program and start earning commissions for every user who uses your code. The more users, the higher your earnings!
ar: انضم لبرنامج التسويق بالعمولة وابدأ بكسب عمولات على كل مستخدم يستخدم كودك الخاص. كلما زاد عدد المستخدمين، زادت أرباحك!

# requestSentTitle
source: Request Sent
ar: تم ارسال طلبك

# requestSentContent
source: Your request will be reviewed and you will be notified upon approval.
ar: سيتم مراجعة طلبك واشعارك بالموافقهً

# requestMarketingButton
source: Request Marketing
ar: طلب تسويق

# referralCodeCopied
source: Code copied successfully
ar: تم نسخ الكود بنجاح

# enterBankData
source: Enter Bank Account Information
ar: أدخل بيانات الحساب البنكي

# accountNumber
source: Account/Visa Number
ar: رقم الحساب/الفيزا

# accountHolder
source: Account Holder Name
ar: اسم صاحب الحساب

# usersUsedLabel
source: Code usage
ar: عدد الذين استخدموا كودك

# currentBalanceLabel
source: Your current balance
ar: رصيدك الحالي

# registrationSuccess
source: Registration successful!
ar: تم التسجيل بنجاح!

source: Registration failed.
ar: فشل في عملية التسجيل، حاول مرة أخرى.

# unexpectedError
source: Please try again.
ar: حدث خطأ غير متوقع، حاول مرة أخرى.

# successTitle
source: Successful
ar: تم بنجاح

# failedTitle
source: Registration Failed
ar: فشل التسجيل

source: Continue to Login
ar: تسجيل الدخول

source: Try Again
ar: حاول مرة أخرى

# networkError
source: Please check your internet connection.
ar: يرجى التحقق من اتصال الإنترنت.

# timeoutError
source: Request timed out. Please try again.
ar: انتهت المهلة، حاول مرة أخرى.

# defaultError
source: Please try again later.
ar: حاول مرة أخرى لاحقًا.

# serverUnavailable
source: Please try again later.
ar: الخادم غير متاح حاليًا، حاول لاحقًا.

# validationError
source: Please check all required fields.
ar: يرجى التحقق من جميع الحقول المطلوبة.

# usernameRequired
source: Username field is required.
ar: اسم المستخدم مطلوب.

# emailUsed
source: This email is already used.
ar: البريد الإلكتروني مستخدم بالفعل.

# phoneUsed
source: This phone number is already used.
ar: رقم الهاتف مستخدم بالفعل.

# passwordWeak
source: Password is too weak.
ar: كلمة المرور ضعيفة جدًا.

# emailRequired
source: Email is required.
ar: البريد الإلكتروني مطلوب.

# invalidEmail
source: Please enter a valid email address.
ar: يرجى إدخال بريد إلكتروني صحيح.

# passwordRequired
source: Password is required.
ar: كلمة المرور مطلوبة.

# passwordLength
source: Password must be at least 6 characters.
ar: يجب ألا تقل كلمة المرور عن 6 أحرف.

# countryCodeRequired
source: Country code is required.
ar: رمز الدولة مطلوب.

# phoneRequired
source: Phone number is required.
ar: رقم الهاتف مطلوب.

# invalidPhone
source: Please enter a valid phone number.
ar: يرجى إدخال رقم هاتف صحيح.

# countryRequired
source: Country is required.
ar: الدولة مطلوبة.

# cityRequired
source: City is required.
ar: المدينة مطلوبة.

# addressRequired
source: Address is required.
ar: العنوان مطلوب.

# checkInfo
source: Please check your information.
ar: يرجى التحقق من المعلومات المدخلة.

# checkFields
source: Please check the fields.
ar: تحقق من الحقول وحاول مرة أخرى.

source: Account not found
ar: الحساب غير موجود

source: Email not verified
ar: البريد الإلكتروني غير مفعل

source: Account suspended
ar: الحساب موقوف

# serverError
source: Server error, please try again later
ar: خطأ في الخادم، يرجى المحاولة لاحقاً

# logoutConfirmation
source: Logout
ar: تسجيل الخروج

# areYouSureLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# invalidEmailOrPassword
source: Invalid password
ar: كلمة المرور غير صحيحة

source: Login failed
ar: فشل تسجيل الدخول

source: Logging out..
ar: جاري تسجيل الخروج..

source: Sending...
ar: تم الارسال..

# failedToSendCode
source: Failed to send reset code
ar: فشل إرسال رمز إعادة التعيين

source: Enter Verification Code
ar: أدخل رمز التحقق

# codeSentTo
source: We sent a verification code to
ar: تم إرسال رمز التحقق إلى

source: Code expires in
ar: تنتهي صلاحية الرمز خلال

# codeMustBe4Digits
source: The code must be 4 digits
ar: يجب أن يتكون الرمز من 4 أرقام

source: Verifying...
ar: جارٍ التحقق...

source: Verify
ar: تحقق

source: Code resent successfully
ar: تم إرسال الرمز بنجاح

# resendFailed
source: Failed to resend code
ar: فشل في إعادة إرسال الرمز

# invalidCode
source: Invalid verification code
ar: رمز التحقق غير صحيح

# codeExpired
source: Verification code has expired
ar: انتهت صلاحية رمز التحقق

source: Verification failed
ar: فشل التحقق

source: Set New Password
ar: تعيين كلمة مرور جديدة
