Repository: Eng-Mahmoud-Mokhtar/Tawq_Al_Najah
Catalog: Assets/Localization/intl_*.arb
Languages: ar

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Password reset failed
ar: فشل في إعادة تعيين كلمة المرور

# invalidOrExpiredCode
source: Invalid or expired verification code
ar: رمز التحقق غير صالح أو منتهي الصلاحية

source: Password requirements not met
ar: لم يتم استيفاء متطلبات كلمة المرور

# passwordResetSuccess
source: Password Reset Successful
ar: تمت إعادة تعيين كلمة المرور بنجاح

# passwordResetSuccessMessage
source: Your password has been reset successfully. You can now login with your new password.
ar: تمت إعادة تعيين كلمة مرورك بنجاح. يمكنك الآن تسجيل الدخول بكلمة المرور الجديدة.

source: Continue to Home
ar: الاستمرار إلى الصفحة الرئيسية

source: Resetting...
ar: جارٍ التعيين...

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Verification Success
ar: تم التحقق بنجاح

source: Sending...
ar: جاري الإرسال...

source: Reset Success
ar: تم إعادة التعيين بنجاح

source: Reset Failed
ar: فشل إعادة التعيين

# unauthorized
source: Unauthorized access
ar: وصول غير مصرح

# forbidden
source: Access forbidden
ar: وصول ممنوع

# sslError
source: SSL certificate error
ar: خطأ في شهادة SSL

source: Request cancelled
ar: تم إلغاء الطلب

source: Community Partnerships
ar: الشراكات المجتمعية

source: Participating Entity
ar: الجهة المشاركة

source: Representative Name
ar: اسم المندوب

source: Food Supplies
ar: المساعدات الغذائية

source: Clothing
ar: الملابس

source: Medical Bill
ar: الفاتورة الطبية

source: Electricity Bill
ar: فاتورة الكهرباء

# fuelBill
source: Fuel Bill (Gasoline + Diesel)
ar: فاتورة الوقود (بنزين + ديزل)

source: School Supplies
ar: لوازم المدرسة

# inKindSupportExample
source: Select type of in-kind support
ar: اختر نوع الدعم العيني

# invalidOtp
source: Invalid verification code
ar: كود التحقق غير صحيح

# otpExpired
source: Verification code has expired
ar: كود التحقق منتهي الصلاحية

# errorLoadingCategories
source: Error loading
ar: حدث خطأ أثناء التحميل

source: Loading...
ar: تحميل

source: Image load failed
ar: فشل تحميل الصورة

source: No products available
ar: لا توجد منتجات متاحة

source: No suggestions available
ar: لا توجد اقتراحات متاحة

# noSellerInfo
source: No seller information
ar: لا توجد معلومات عن البائع

source: Full Name
ar: الاسم الكامل

source: Phone Number
ar: رقم الهاتف

source: Choose Country Code
ar: اختر رمز الدولة

source: No Results to Show
ar: لا توجد نتائج للعرض

# nameRequired
source: Name is required
ar: الاسم مطلوب

# nameMinLength
source: Name must be at least 3 characters
ar: يجب أن يكون على الأقل 3 أحرف

# emailInvalid
source: Invalid email format
ar: البريد الإلكتروني غير صالح

# phoneNumbersOnly
source: Phone number must contain only numbers
ar: رقم الهاتف يجب أن يحتوي على أرقام فقط

# phoneAlreadyUsed
source: This phone number is already in use.
ar: رقم الهاتف مستخدم بالفعل.

# emailAlreadyUsed
source: This email is already in use.
ar: البريد الإلكتروني هذا مستخدم بالفعل.

# locationRequired
source: Address is required
ar: العنوان مطلوب

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Session expired.
ar: يرجى تسجيل الدخول مرة أخرى.

# serviceUnavailable
source: Service is currently unavailable.
ar: الخدمة غير متاحة حالياً.

# connectionTimeout
source: Please check your internet connection.
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# cannotConnectToServer
source: Please check your internet connection.
ar: يرجى التحقق من اتصال الإنترنت.

source: Connection error
ar: خطأ في الاتصال

source: Profile data not available.
ar: بيانات الملف الشخصي غير متاحة.

source: Failed to load data
ar: فشل في تحميل البيانات

source: Failed to update profile
ar: فشل في تحديث الملف الشخصي

source: Invalid data
ar: بيانات غير صالحة

# nameInvalid
source: Invalid name
ar: الاسم غير صالح

source: Error picking image
ar: حدث خطأ أثناء اختيار الصورة

source: Search country
ar: ابحث عن دولة

source: Support
ar: الدعم

source: Select Support Type
ar: اختر نوع الدعم

source: Packages
ar: الباقات

source: Package Value
ar: قيمة الباقة

source: Select package value
ar: اختر قيمة الباقة

source: Enter other value
ar: اكتب قيمة أخرى

# submitDonation
source: Submit
ar: إرسال الطلب

# selectPackageError
source: Please select package value
ar: يرجى اختيار قيمة الباقة

# donationSentSuccessfully
source: Submit sent successfully
ar: تم إرسال الطلب بنجاح

source: Please login first
ar: يرجى تسجيل الدخول أولاً

source: Attention
ar: انتباه

source: Delete Confirmation
ar: تأكيد الحذف

# deleteItemConfirmation
source: Are you sure you want to delete this item from the cart?
ar: هل أنت متأكد من حذف هذا العنصر من السلة؟

source: Cart is empty
ar: السلة فارغة

# errorNavigatingToCheckout
source: Error navigating to checkout page
ar: حدث خطأ أثناء الانتقال إلى صفحة الدفع

source: Insufficient stock
ar: المخزون غير كافي

source: Free
ar: مجاني

source: Loading cart...
ar: جاري تحميل السلة...

# orderSummary
source: Summary
ar: ملخص الطلب

source: Cash on delivery
ar: عند الاستلام

# creditCard
source: Credit/Debit Card
ar: بطاقة ائتمان

# pleaseFillCardDetails
source: Fill all card details
ar: أدخل بيانات البطاقة

source: Order failed
ar: فشل الطلب

# somethingWentWrong
source: An error occurred
ar: حدث خطأ

source: Processing...
ar: جاري المعالجة...

# cashDeliveryNote
source: Pay cash upon delivery.
ar: الدفع نقداً عند التسليم.

# cardPaymentNote
source: Your card is secure. Payment is processed instantly.
ar: بياناتك آمنة والدفع فوري.

# requestRejected
source: Your request has been rejected
ar: تم رفض طلبك

# requestUnderReview
source: Your request is under review
ar: طلبك قيد المراجعة

# requestPendingContent
source: Your request has been submitted successfully and is currently under review. You will be contacted as soon as possible.
ar: تم إرسال طلبك بنجاح وهو الآن قيد المراجعة، سيتم الرد في أسرع وقت.

# requestRejectedContent
source: Sorry, your request to join the affiliate marketing program has been rejected. Please contact support to have your application reviewed again.
ar: عذراً، تم رفض طلب انضمامك لبرنامج التسويق بالعمولة. يجب التواصل مع الدعم ليتم النظر في طلب الانضمام لك مرة أخرى.

source: Your referral code
ar: كود الإحالة الخاص بك

# shareReferralCodeHint
source: Share this code with your friends to earn a commission
ar: شارك هذا الكود مع أصدقائك لتحصل على عمولة

# codeNotAssigned
source: The code has not been assigned yet
ar: لم يتم تعيين الكود بعد

# mustLoginForSupport
source: You must log in to be able to submit an in-kind support request
ar: يجب تسجيل الدخول لتتمكن من تقديم طلب دعم عيني

# noCharitiesAvailable
source: No charities are currently available
ar: لا يوجد جمعيات متاحة حالياً

# noSupportTypesAvailable
source: No support types are currently available
ar: لا يوجد أنواع دعم متاحة حالياً

source: and
ar: و

# requestFailed
source: Failed to submit the request
ar: فشل إرسال الطلب

source: Recent Searches
ar: عمليات البحث الأخيرة

source: Enter Amount
ar: أدخل المبلغ

# enterValidAmount
source: Enter a Valid Amount
ar: أدخل مبلغًا صحيحًا

source: Donation Failed
ar: فشل إرسال التبرع

source: Financial Support
ar: دعم مالي

# donationDescriptionExample
source: Example: Financial donation to support charitable activities
ar: مثال: تبرع مالي لدعم الأنشطة الخيرية

source: No Packages Available
ar: لا توجد باقات متاحة

# priceRequired
source: Le prix est requis
ar: السعر مطلوب

# enterValidPrice
source: Veuillez entrer un prix valide
ar: يرجى إدخال سعر صحيح

# enterValidDiscount
source: La remise doit être comprise entre 0 et 100
ar: يجب أن يكون الخصم بين 0 و 100

# imageRequired
source: Au moins une image est requise
ar: مطلوب صورة واحدة على الأقل

# optional
source: Optionnel
ar: اختياري

# enterPrice
source: Entrez le prix
ar: أدخل السعر

# enterDiscount
source: Entrez la remise
ar: أدخل الخصم

# adDeletedSuccess
source: Ad deleted successfully
ar: تم حذف الإعلان بنجاح

source: Failed to delete ad
ar: فشل في حذف الإعلان

# errorDeletingAd
source: An error occurred while deleting the ad
ar: حدث خطأ أثناء حذف الإعلان

# orderNumberLabel
source: Order
ar: طلب رقم

# productsCountLabel
source: items
ar: منتج

# noItemsInOrder
source: No items in this order
ar: لا توجد منتجات في هذا الطلب

source: Unnamed product
ar: منتج بدون اسم

# discountLabel
source: Discount
ar: خصم

source: Cancelling order...
ar: جاري إلغاء الطلب...

# orderCancelledSuccess
source: Order cancelled successfully
ar: تم حذف هذا الطلب بنجاح
